[{
    "date": "2015-01-21T23:00:00.000Z",
    "talks": [{
      "title": "Serious text editing in the browser",
      "level": "Advanced",
      "language": "es",
      "speaker": {
        "twitter": "marijnjh",
        "name": "Marijn Haverbeke",
        "portrait": ""
      },
      "description": "When a textarea doesn't cut it anymore, there are alternatives: full-featured text and code editors written in browser JavaScript. This talk is about CodeMirror, one such editor. It'll explore the intricacies of faking an editable control, the challenges of making it scale to hundreds of thousands of lines, and the integration of modern code editor features."
}, {
      "title": "Development environments using fig",
      "level": "Beginner",
      "language": "en",
      "speaker": {
        "twitter": "dias_jorge",
        "name": "Jorge Dias",
        "portrait": ""
      },
      "description": "Jorge Dias, Software Engineer turned Devops @ Xing, responsible for development and testing environments is going to talk about the research being done at Xing regarding the use of docker and will do a brief overview of working with fig and some custom tools to improve the workflow."
}]
},
  {
    "date": "2015-02-18T23:00:00.000Z",
    "talks": [{
      "title": "Ionic 101",
      "level": "Beginner",
      "language": "es",
      "speaker": {
        "twitter": "vampaynani",
        "name": "Wenceslao Negrete",
        "portrait": "https://avatars3.githubusercontent.com/u/350815?v=3&s=400"
      },
      "description": "An introduction to this friendly angular framework to build great hybrid apps with web technologies you already know and love."
    }, {
      "title": "Arquillian loves JavaScript too.",
      "level": "advanced",
      "language": "es",
      "speaker": {
        "twitter": "alexsotob",
        "name": "Alex Soto",
        "portrait": "https://avatars2.githubusercontent.com/u/1517153?v=3&s=400"
      },
      "description": "Nowadays a lot of applications are being developed not using a single language but more than one. One of the most used paradigm is implementing the front-end using Html + JavaScript (for example with AngularJs) and implementing the back-end with Java. There is a lot of test frameworks for Javascipt code and the same for Java, but if you want to test system wide in an automatic way it seems that you need some kind of glue to meet both worlds. Come to this session to learn how Arquillian can help you on writing tests for these applications."
    }]
},
  {
    "date": "2015-03-17T23:00:00.000Z",
    "talks": [{}, {}]
},
  {
    "date": "2015-04-21T23:00:00.000Z",
    "talks": [{}, {}]
}]
