[{
    "date": "2015-01-21T23:00:00.000Z",
    "talks": [{
      "title": "Serious text editing in the browser",
      "level": "Advanced",
      "language": "es",
      "speaker": {
        "twitter": "marijnjh",
        "name": "Marijn Haverbeke",
        "portrait": ""
      },
      "description": "When a textarea doesn't cut it anymore, there are alternatives: full-featured text and code editors written in browser JavaScript. This talk is about CodeMirror, one such editor. It'll explore the intricacies of faking an editable control, the challenges of making it scale to hundreds of thousands of lines, and the integration of modern code editor features."
}, {
      "title": "Development environments using fig",
      "level": "Beginner",
      "language": "en",
      "speaker": {
        "twitter": "dias_jorge",
        "name": "Jorge Dias",
        "portrait": ""
      },
      "description": "Jorge Dias, Software Engineer turned Devops @ Xing, responsible for development and testing environments is going to talk about the research being done at Xing regarding the use of docker and will do a brief overview of working with fig and some custom tools to improve the workflow."
}]
},
  {
    "date": "2015-02-18T23:00:00.000Z",
    "talks": [{
      "title": "Arquillian loves JavaScript too.",
      "level": "advanced",
      "language": "es",
      "speaker": {
        "twitter": "alexsotob",
        "name": "Alex Soto",
        "portrait": "https://avatars2.githubusercontent.com/u/1517153?v=3&s=400"
      },
      "description": "Nowadays a lot of applications are being developed not using a single language but more than one. One of the most used paradigm is implementing the front-end using Html + JavaScript (for example with AngularJs) and implementing the back-end with Java. There is a lot of test frameworks for Javascipt code and the same for Java, but if you want to test system wide in an automatic way it seems that you need some kind of glue to meet both worlds. Come to this session to learn how Arquillian can help you on writing tests for these applications."
    },{
      "title": "jQuery plugin for better HTML file inputs",
      "level": "beginner",
      "language": "en",
      "speaker": {
        "twitter": "mparramon",
        "name": "Miguel Parramon",
        "portrait": "https://avatars0.githubusercontent.com/u/636075?v=3&s=400"
      },
      "description": "Have you ever wanted to style an HTML file input in a easy way? I did, so I took [this guide](quirksmode.org/dom/inputfile.html) And turned it into a [jQuery plugin](plugins.jquery.com/enhancedfileinput/). [Here are some slides](http://www.developingandstuff.com/2013/01/jquery-plugin-for-better-html-file.html) I made for colognejs.de about developing it with Jasmine specs."
    }]
},
  {
    "date": "2015-03-17T23:00:00.000Z",
    "talks": [{
      "title": "Developing mobile web apps for the real world with Ionic Framework",
      "level": "advanced",
      "language": "es",
      "speaker": {
        "twitter": "dcomasf",
        "name": "Daniel Comas Fernández",
        "portrait": "https://avatars2.githubusercontent.com/u/4038192?v=3&s=400"
      },
      "description": "It is well-known that develop in Android and iOS is a hardest task. For many companies the cost of develop and maintain two parallel environments is very expensive, and of course for a logic reason it isn't a good approach. At present, Many solutions exist to solve this, PhoneGap, Xamarin, the recent but only introduced ReactJS Native and of course Ionic. In this speech I will show how it works with some demos and the pros and cons about to use Ionic to develop web mobile apps for the real world."
    },{
      "title": "Introduction to React.js",
      "level": "beginner",
      "language": "en",
      "speaker": {
        "twitter": "ustunozgur",
        "name": "Ustun Ozgur"
      },
      "description": "Building UI's is hard, but JavaScript is not to blame. Facebook's open source UI library React.js introduces a sane solution to building UI's, based on uni-directional flow and components with clear interfaces. Although object oriented in appeareance, React builds itself on a functional programming basis, making programs written by this library easy to develop and reason about. In this talk, we will go over the founding principles of this exciting library which has been steadily gaining popularity since it was first introduced in May 2013. We will also briefly talk about accompanying technologies such as Flux, immutablejs and react-router."
    }, {
      "title": "St. Patrick's Day!",
      "level": "experts",
      "language": "en",
      "speaker": {
        "twitter": "#StPatricksDay",
        "name": "Saint Patrick"
      },
      "description": "After the talks we'll take cabs straight to Michael Collins Pub (Plaça de la Sagrada Família 4) to celebrate St. Patrick's Day."
      }]
},
  {
    "date": "2015-04-21T23:00:00.000Z",
    "talks": [{}, {}]
}]
